//=============================================================================
//
// タイトル処理 [title.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "scene2D.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_UI (4)

//=============================================================================
// クラス定義
//=============================================================================
class CTitle
{
public:
	CTitle();							// コンストラクタ
	~CTitle();							// デストラクタ
	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 開放処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理

	static void LoadAsset(void);		// アセットの読み込み処理

private:
	CScene2D *pBack[MAX_UI];					// UI
	int m_nCarType;								// 車の種類
	float m_fMove;								// 背景のスクロール
	float m_fAlpha;								// 透明度
	bool m_bAlpha;								// 透明度フラグ
};
#endif