//=============================================================================
//
// チュートリアル処理 [tutorial.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// クラス定義
//=============================================================================
class CTutorial
{
public:
	CTutorial();								// コンストラクタ
	~CTutorial();								// デストラクタ
	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 開放処理
	void Update(void);						// 更新処理
	void Draw(void);						// 描画処理

	static void LoadAsset(void);			// アセットの読み込み

private:

};
#endif